/*Напишите программу, которая принимает на вход трёхзначное число
 и на выходе показывает вторую цифру этого числа.*/

Console.Write("Введите 3-х значное число:  ");
string num = Console.ReadLine();
Console.Write(num[1]);
